Vulnerability Test Results/artillery-load-test.yml
config:
  target: "https://cryptaf-36296.web.app"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Sustained Baseline Load"
  plugins:
    expect: {}

scenarios:
  - name: "Fetch Emergency Card"
    flow:
      - get:
          url: "/emergency.html?uid=TEST_UID"
          expect:
            - statusCode: 200
